Repository: Husssam12/flutter-steps-tracker
Catalog: lib/l10n/intl_*.arb
Languages: ar

# app_splash_title
source: The Duck Is Walking Now!
ar: البطة تمشي الآن!

# app_title
source: Flutter Steps Tracker
ar: متتبع خطوات

source: Welcome
ar: مرحبا

source: Login
ar: تسجيل الدخول

source: Antonymous Login
ar: تسجيل بدون حساب

source: Sign Up
ar: تسجيل حساب

source: Skip
ar: تخطي

# enter_email
source: Enter a email
ar: ادخل البريد الابكتروني

# enter_name
source: Enter your name
ar: ادخل اسمك

# email_validation
source: Enter a valid email
ar: ادخل بريد الكتروني صالح!

source: Cancel
ar: إالغاء

# continue_t
source: continue
ar: التالي

# required_validation
source: This filed is required
ar: هذا الحقل مطلوب!

# enter_password
source: Enter a password
ar: ادخل كلمة المرور

# steps_today
source: Your steps today
ar: خطواتك اليوم

source: Health Points
ar: نفاط الصحة

source: Redeems
ar: مقايضات

# health_points_clarify
source: Get {bigReward} HP for {big} steps, and {smallReward} HP for {small} steps
ar: احصل على {bigReward} نقطة صحة من أجل {big} خطوة، و {smallReward} نقطة صحة من أجل {small} خطوة

# award_title
source: You awarded a {hp} HP
ar: حصلت على {hp} نقطة صحة

# redeems_title
source: You bought a {name} and spent {hp} HP
ar: اشتريت {name} واستخدمت {hp} نقطة صحة

source: Big one
ar: جائزة كبيرة

# keep_moving
source: Keep moving, you got {hp} HP
ar: استمر بالسير، حصلت على {hp} نقطة صحة

# empty_gifts
source: There is no gifts yet! 😭
ar: لا يوجد هدايا بعد! 😭

# empty_health_points_history
source: No redeems 😢
ar: لم تقك بأي غملية استبدال 😢

# empty_redeems_history
source: There is no gifts yet! 😭
ar: لم تقم بشراء شيء بعد! 😭

# empty_rank
source: Lazy Town!🌚
ar: مدينة الكسالى! 🌚

# now_enough_hp
source: No enough HP!
ar: لا يوجد نقاط صحة كافية!

# not_supported_device
source: Device is not supported!
ar: الجهاز ليس مدعوما!
